#include "Header.h"
string get_s[] = { "Иванов", "Петров", "Сидоров", "Смирнов", "Кузнецов",
        "Попов", "Васильев", "Соколов", "Михайлов", "Новиков",
        "Фёдоров", "Морозов", "Волков", "Алексеев", "Лебедев",
        "Семёнов", "Егоров", "Павлов", "Козлов", "Степанов",
        "Николаев", "Орлов", "Андреев", "Макаров", "Никитин",
        "Захаров", "Зайцев", "Соловьёв", "Борисов", "Яковлев" };

string get_nms[] = { "Александр", "Дмитрий", "Максим", "Сергей", "Андрей",
        "Алексей", "Артём", "Илья", "Кирилл", "Михаил",
        "Никита", "Егор", "Матвей", "Даниил", "Владислав",
        "Иван", "Евгений", "Николай", "Олег", "Роман",
        "Тимур", "Ярослав", "Глеб", "Лев", "Василий",
        "Георгий", "Антон", "Павел", "Виктор", "Степан" };

string get_p[] = { "Александрович", "Дмитриевич", "Максимович", "Сергеевич", "Андреевич",
        "Алексеевич", "Артемьевич", "Ильич", "Кириллович", "Михайлович",
        "Никитич", "Егорович", "Матвеевич", "Даниилович", "Владиславович",
        "Иванович", "Евгеньевич", "Николаевич", "Олегович", "Романович",
        "Тимурович", "Ярославович", "Глебович", "Львович", "Васильевич",
        "Георгиевич", "Антонович", "Павлович", "Викторович", "Степанович" };


int proverka_na_int() {
    double p;
    while (true) {
        cin >> p;
        if ((cin.fail()) || (p - (int)p)) {
            cout << "Ошибка ввода \n";
            cin.clear();
            cin.ignore(10000000000, '\n');
        }
        else {
            cout << "Введено: " << p << "\n";
            return (int)p;
        }
    }
}

string get_a[] = { "ветеран", "нету примечаний", "хороший послужной список", "новичек", "старший механик" };

string proverka_na_char() {
    string b;
    while (true) {
        cin >> b;

        if (b.size() == 1) {
            cout << "Введено: " << b << "\n";
            return b;
        }

        cout << "Только один символ\n";
        cin.clear();
        cin.ignore(10000000000, '\n');
    }
}